benchmark/FieldExamples/zeroThicknessMembrane/zeroThicknessMembraneOF/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)	// 0
    (8 0 0)	// 1
    (8 0 0)	// 2
    (25 0 0)	// 3
    (0 1 0)	// 4
    (8 1 0)	// 5
    (25 1 0)	// 6
    (0 8 0)	// 7
    (8 8 0)	// 8
    (25 8 0)	// 9

    (0 0 1)	// 10
    (8 0 1)	// 11
    (8 0 1)	// 12
    (25 0 1)	// 13
    (0 1 1)	// 14
    (8 1 1)	// 15
    (25 1 1)	// 16
    (0 8 1)	// 17
    (8 8 1)	// 18
    (25 8 1)	// 19
);

blocks
(
    hex (0 1 5 4 10 11 15 14)     (40 20 1) simpleGrading (0.33 1 1)
    hex (2 3 6 5 12 13 16 15)     (80 10 1) simpleGrading (3 1 1)
    hex (4 5 8 7 14 15 18 17)     (40 40 1) simpleGrading (0.33 4 1)
    hex (5 6 9 8 15 16 19 18)     (80 40 1) simpleGrading (3 4 1)    
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (10 14 4 0)
	    (14 17 7 4)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
            (6 9 19 16)
            (3 6 16 13)
        );
    }
    
    top
    {
        type wall;
        faces
        (
            (9 8 18 19)
	    (8 7 17 18)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (0 1 11 10)
	    (2 3 13 12)
        );
    }
    
 
    
    baffle1
    {
        type wall;
        faces 
        (
	      (1 5 15 11)
	);
    }
    
    baffle2
    {
        type wall;
        faces 
        (
	      (5 2 12 15)
	);
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (8 5 4 7)
            (9 6 5 8)
	    (4 5 1 0)
	    (5 6 3 2)
            (18 17 14 15)
            (19 18 15 16)
	    (15 14 10 11)
	    (16 15 12 13)
        );
    }    
);

mergePatchPairs
(
);

// ************************************************************************* //
